In [ ]:
#Data Cleaning and Preparation

In [1]:
import numpy as np
import pandas as pd
float_data = pd.Series([1.2, -3.5, np.nan, 0])
float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [2]:
#Filtering out missing data
data = pd.Series([1, np.nan, 3.5, np.nan, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [3]:
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],
                     [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [5]:
data.dropna(how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [ ]:
#Keeping rows with threshold number of observations

In [6]:
df = pd.DataFrame(np.random.standard_normal((7, 3)))
df.iloc[:4, 1] = np.nan
df.iloc[:2, 2] = np.nan
df

          0         1         2
0 -0.229093       NaN       NaN
1 -1.052490       NaN       NaN
2  0.776256       NaN -0.689479
3 -0.954663       NaN -0.512880
4  1.346601 -1.555524 -0.563661
5 -0.699598  0.719527  1.549002
6 -0.537911  0.947553  1.684621

In [7]:
df.dropna()

          0         1         2
4  1.346601 -1.555524 -0.563661
5 -0.699598  0.719527  1.549002
6 -0.537911  0.947553  1.684621

In [8]:
df.dropna(thresh=2)

          0         1         2
2  0.776256       NaN -0.689479
3 -0.954663       NaN -0.512880
4  1.346601 -1.555524 -0.563661
5 -0.699598  0.719527  1.549002
6 -0.537911  0.947553  1.684621

In [9]:
#Filling in missing data
df.fillna(0)

          0         1         2
0 -0.229093  0.000000  0.000000
1 -1.052490  0.000000  0.000000
2  0.776256  0.000000 -0.689479
3 -0.954663  0.000000 -0.512880
4  1.346601 -1.555524 -0.563661
5 -0.699598  0.719527  1.549002
6 -0.537911  0.947553  1.684621

In [10]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.229093  0.500000  0.000000
1 -1.052490  0.500000  0.000000
2  0.776256  0.500000 -0.689479
3 -0.954663  0.500000 -0.512880
4  1.346601 -1.555524 -0.563661
5 -0.699598  0.719527  1.549002
6 -0.537911  0.947553  1.684621

In [11]:
data = pd.Series([1., np.nan, 3.5, np.nan, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [12]:
#Removing Duplicates
data = pd.DataFrame({"k1": ["one", "two"] * 3 + ["two"],
                     "k2": [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [13]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [14]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [15]:
data["v1"] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [17]:
data.drop_duplicates(subset=["k1"])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [18]:
#Mapping data
data = pd.DataFrame({"food": ["bacon", "pulled pork", "bacon",
                              "pastrami", "corned beef", "bacon",
                              "pastrami", "honey ham", "nova lox"],
                     "ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [19]:
meat_to_animal = {
  "bacon": "pig",
  "pulled pork": "pig",
  "pastrami": "cow",
  "corned beef": "cow",
  "honey ham": "pig",
  "nova lox": "salmon"
}
data["animal"] = data["food"].map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [20]:
def get_animal(x):
    return meat_to_animal[x]
data["food"].map(get_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [22]:
#Replacing data
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [23]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [24]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [25]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [26]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [27]:
#Renaming Axis Indexes
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=["Ohio", "Colorado", "New York"],
                    columns=["one", "two", "three", "four"])
def transform(x):
    return x[:4].upper()

data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [29]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [31]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [33]:
#Discretization and Binning

ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
age_categories = pd.cut(ages, bins)
age_categories

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [40]:
group_names = ["Youth", "YoungAdult", "MiddleAged", "Senior"]
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [41]:
data = np.random.standard_normal(1000)
quartiles = pd.qcut(data, 4, precision=2)
quartiles

[(-3.2399999999999998, -0.7], (0.68, 3.2], (0.033, 0.68], (-3.2399999999999998, -0.7], (-0.7, 0.033], ..., (0.68, 3.2], (0.033, 0.68], (-3.2399999999999998, -0.7], (0.68, 3.2], (-3.2399999999999998, -0.7]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.2399999999999998, -0.7] < (-0.7, 0.033] < (0.033, 0.68] < (0.68, 3.2]]

In [42]:
pd.value_counts(quartiles)

/var/folders/w0/zskql2916zgfxr5rzfpzm9s00000gn/T/ipykernel_44991/3472704981.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(quartiles)

(-3.2399999999999998, -0.7]    250
(-0.7, 0.033]                  250
(0.033, 0.68]                  250
(0.68, 3.2]                    250
Name: count, dtype: int64

In [43]:
#Detecting and filtering outliers
data = pd.DataFrame(np.random.standard_normal((1000, 4)))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.009151     0.028268     0.031765    -0.013382
std       0.986801     1.027513     0.976751     0.998820
min      -3.504636    -3.082863    -2.965365    -3.843732
25%      -0.649935    -0.643462    -0.588542    -0.699620
50%       0.034271    -0.008239     0.029481    -0.028478
75%       0.687777     0.694743     0.687611     0.616429
max       3.344415     3.894177     3.009586     3.687616

In [44]:
col = data[2]
col[col.abs() > 3]

895    3.009586
Name: 2, dtype: float64

In [45]:
data[(data.abs() > 3).any(axis="columns")]

            0         1         2         3
13  -0.554244  3.894177 -1.664220 -1.122888
63   3.344415 -0.611434 -2.696649  1.260605
274 -0.281647  3.414617 -0.928876 -0.106349
350 -1.038352 -0.522813  0.434232  3.687616
375 -3.029659 -0.819879  0.324866  1.097085
421  0.572119  0.201115  0.853419  3.304535
424  0.447881  3.081982 -0.823613 -0.584763
443  0.587290 -0.709879 -0.589427  3.435294
706 -3.504636  0.751393 -0.742553 -0.171935
717  0.255990 -3.082863  1.220769  0.284857
754 -0.465419  0.234760 -0.739192  3.039146
895 -1.070850  0.617064  3.009586  0.147514
961 -1.084496  1.110005 -0.087547 -3.843732

In [46]:
#How to cap values outside interval ranges ie here i cap +-3 to 3.0 or -3.0
data[data.abs() > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.009341     0.026960     0.031756    -0.014004
std       0.983931     1.022750     0.976722     0.991100
min      -3.000000    -3.000000    -2.965365    -3.000000
25%      -0.649935    -0.643462    -0.588542    -0.699620
50%       0.034271    -0.008239     0.029481    -0.028478
75%       0.687777     0.694743     0.687611     0.616429
max       3.000000     3.000000     3.000000     3.000000

In [47]:
#String manipulation methods
val = "a,b,  guido"
val.split(",")

['a', 'b', '  guido']

In [48]:
pieces = [x.strip() for x in val.split(",")]
pieces

['a', 'b', 'guido']

In [50]:
values = pd.Series(['apple', 'orange', 'apple',
                    'apple'] * 2)
values
pd.unique(values)

array(['apple', 'orange'], dtype=object)

In [51]:
pd.value_counts(values)

/var/folders/w0/zskql2916zgfxr5rzfpzm9s00000gn/T/ipykernel_44991/3297668723.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(values)

apple     6
orange    2
Name: count, dtype: int64

In [52]:
values = pd.Series([0, 1, 0, 0] * 2)
dim = pd.Series(['apple', 'orange'])
values

0    0
1    1
2    0
3    0
4    0
5    1
6    0
7    0
dtype: int64

In [53]:
dim

0     apple
1    orange
dtype: object

In [54]:
dim.take(values)

0     apple
1    orange
0     apple
0     apple
0     apple
1    orange
0     apple
0     apple
dtype: object

In [55]:
categories = ['foo', 'bar', 'baz']
codes = [0, 1, 2, 0, 0, 1]
my_cats_2 = pd.Categorical.from_codes(codes, categories)
my_cats_2

['foo', 'bar', 'baz', 'foo', 'foo', 'bar']
Categories (3, object): ['foo', 'bar', 'baz']